dastin-alex/esp8266_test/src/main.cpp
  pinMode(LED_BUILTIN, OUTPUT); // режим OUTPUT

  ///////////////////////////////////////////////////////////////////////////////////////
  // ------------------------------------------------------------------------------------
  //                                                       ОДНОКРАТНО ИСПОЛНЯЕМЫЙ ПРОЦЕСС
  // контроль нажатия встроенной кнопки                                          keypress
  // начальная настройка контакта встроенной кнопки FLASH
  // ------------------------------------------------------------------------------------
  ///////////////////////////////////////////////////////////////////////////////////////
  // ------------------------------------------------------------------------------------
  //
  // (KP00) -> KP01, KP02, KP03, KP04, KP05, KP06, KP07, KP08
  //            |                                         |
  //            |-----------------------------------------|
  //
  // ------------------------------------------------------------------------------------
  ///////////////////////////////////////////////////////////////////////////////////////

  /////////////////////////////////////////////////////////////////////////////// KP00
  // ----------------------------------------------------------------------------
  // начальная настройка
  // контакт встроенной кнопки FLASH (IO0, GPIO0, SPICS2) - 15
  // ----------------------------------------------------------------------------
  ///////////////////////////////////////////////////////////////////////////////

  pinMode(15, INPUT_PULLUP); // режим INPUT_PULLUP
}

///////////////////////////////////////////////////////////////////////////////
// ----------------------------------------------------------------------------
//                                                             ФУНКЦИИ-ПРОЦЕССЫ
// бесконечное исполнение                                                  loop
// ----------------------------------------------------------------------------
///////////////////////////////////////////////////////////////////////////////

void loop()

{

  ///////////////////////////////////////////////////////////////////////////////////////
  // ------------------------------------------------------------------------------------
  // КОНСТАНТЫ
  // ------------------------------------------------------------------------------------
  ///////////////////////////////////////////////////////////////////////////////////////

  const unsigned long seventyYears = 2208988800UL; // количество секунд в 70 годах
  const unsigned long secsDay = 86400L;            // количество секунд в одном дне

  ///////////////////////////////////////////////////////////////////////////////////////
  // ------------------------------------------------------------------------------------
  // ЛОКАЛЬНЫЕ ПЕРЕМЕННЫЕ
  // ------------------------------------------------------------------------------------
  ///////////////////////////////////////////////////////////////////////////////////////

  int cb;                      // длина принятого пакета
  unsigned long highWord;      // буфер хранения байтов 40,41 принятого пакета
  unsigned long lowWord;       // буфер хранения байтов 42,43 принятого пакета
  unsigned long secsSince1900; // время NTP. количество секунд, прошедших от даты Jan 1 1900
  unsigned long epoch;         // время UNIX. количество секунд, прошедших от даты Jan 1 1970
  unsigned long tdelta = 3;    // время GMT+3. количество часов смещения от GMT
  unsigned long gmt3;          // время GMT+3. время UNIX + смещение от GMT
  int thrs, tmin, tsec;        // время GMT+3. количество часов, минут, секунд

  ///////////////////////////////////////////////////////////////////////////////////////
  // ------------------------------------------------------------------------------------
  //                                                        РЕГУЛЯРНО ИСПОЛНЯЕМЫЙ ПРОЦЕСС
  // периодический вывод в UART значения времени,                                timescan
  // полученного от сервера времени NTP
  // ------------------------------------------------------------------------------------
  ///////////////////////////////////////////////////////////////////////////////////////

  /////////////////////////////////////////////////////////////////////////////// TS06
  // ----------------------------------------------------------------------------
  //                                                                       ЗАДАЧА
  // подключение к сети WIFI.
  // случайный выбор сервера NTP из пула
  // ----------------------------------------------------------------------------
  ///////////////////////////////////////////////////////////////////////////////

  WiFi.hostByName(ntpServerName, timeServerIP); // МЕТОД WiFi.hostByName

  /////////////////////////////////////////////////////////////////////////////// TS07
  // ----------------------------------------------------------------------------
  //                                                                       ЗАДАЧА
  // начальная установка битовых полей пакета запроса времени NTP.
  // установка всех байтов буфера пакета в 0.
  // установка необходимых байтов буфера пакета.
  // байты 4 .. 11 (8 байтов) соответствуют полям Root Delay и Root Dispersion
  // ----------------------------------------------------------------------------
  ///////////////////////////////////////////////////////////////////////////////

  memset(packetBuffer, 0, NTP_PACKET_SIZE);

  packetBuffer[0] = 0b11100011; // LI, версия, режим
  packetBuffer[1] = 0;          // уровень или тип часов
  packetBuffer[2] = 6;          // интервал
  packetBuffer[3] = 0xEC;       // точность (Peer Clock Precision)

  packetBuffer[12] = 49;
  packetBuffer[13] = 0x4E;
  packetBuffer[14] = 49;
  packetBuffer[15] = 52;

  /////////////////////////////////////////////////////////////////////////////// TS08
  // ----------------------------------------------------------------------------
  //                                                                       ЗАДАЧА
  // пакет запроса времени NTP сформирован.
  // отправка пакета NTP в выбранный сервер времени.
  // передача пакета в порт 123.
  // ----------------------------------------------------------------------------
  ///////////////////////////////////////////////////////////////////////////////

  udp.beginPacket(timeServerIP, 123);       // МЕТОД udp.beginPacket
  udp.write(packetBuffer, NTP_PACKET_SIZE); // МЕТОД udp.write
  udp.endPacket();                          // МЕТОД udp.endPacket

