dastin-alex/esp8266_test/src/main.cpp
  /////////////////////////////////////////////////////////////////////////////// TS09
  // ---------------------------------------------------------------------- delay 1000
  //                                                                       ЗАДАЧА
  // ожидается ответ сервера на запрос
  // пауза ожидания ответа севера 100 мсек
  // ----------------------------------------------------------------------------
  ///////////////////////////////////////////////////////////////////////////////

  delay(1000);

  /////////////////////////////////////////////////////////////////////////////// TS10
  // ----------------------------------------------------------------------------
  //                                                                       ЗАДАЧА
  // попытка разобрать пакет UDP
  // синтаксический разбор результата, полученного из сети WIFI.
  // ЕСЛИ длина пакета = 0 : ТО пакет UDP не принят
  // ЕСЛИ длина пакета != 0 : ТО пакет UDP получен
  // ----------------------------------------------------------------------------
  ///////////////////////////////////////////////////////////////////////////////

  cb = udp.parsePacket(); // МЕТОД udp.parsePacket

  if (cb)

  {

    /////////////////////////////////////////////////////////////////////////////// TS11
    // ----------------------------------------------------------------------------
    //                                                                       ЗАДАЧА
    // сохранение полученного пакета в буфер
    // ----------------------------------------------------------------------------
    ///////////////////////////////////////////////////////////////////////////////

    udp.read(packetBuffer, NTP_PACKET_SIZE); // МЕТОД udp.read

    /////////////////////////////////////////////////////////////////////////////// TS12
    // ----------------------------------------------------------------------------
    //                                                                       ЗАДАЧА
    // длина битового поля информации о времени равна четырем байтам (два слова).
    // начинается с 40-го байта принятого пакета.
    // старшее слово - байты 40 .. 41
    // младшее слов0 - байты 42 .. 43
    // ----------------------------------------------------------------------------
    ///////////////////////////////////////////////////////////////////////////////

    highWord = word(packetBuffer[40], packetBuffer[41]);
    lowWord = word(packetBuffer[42], packetBuffer[43]);

    /////////////////////////////////////////////////////////////////////////////// TS13
    // ----------------------------------------------------------------------------
    //                                                                       ЗАДАЧА
    // время NTP. количество секунд, прошедших с даты Jan 1 1900
    // объединение четырех байтов в одно длинное целое число
    // время UNIX. количество секунд, прошедших с даты Jan 1 1970
    // вычитание из времени NTP количества секунд в 70 годах
    // время GMT+3. значение времени UNIX в Москве
    // прибавление к времени UNIX количества секунд в tdelta часах
    // ----------------------------------------------------------------------------
    ///////////////////////////////////////////////////////////////////////////////

    secsSince1900 = highWord << 16 | lowWord;
    epoch = secsSince1900 - seventyYears;
    gmt3 = epoch + tdelta * 3600;

    /////////////////////////////////////////////////////////////////////////////// TS14
    // ----------------------------------------------------------------------------
    //                                                                       ЗАДАЧА
    // печать в UART информации о результатах расчёта времени
    // время GMT соответствует меридиану Гринвича (Greenwich Meridian time)
    // время GMT+3 соответствует текущему времени в Москве
    // ----------------------------------------------------------------------------
    ///////////////////////////////////////////////////////////////////////////////

    Serial.print("packet length = "); // МЕТОД Serial.print
    Serial.println(cb);               // МЕТОД Serial.println
    Serial.print("NTP time   = ");    // МЕТОД Serial.print
    Serial.println(secsSince1900);    // МЕТОД Serial.println
    Serial.print("GMT time   = ");    // МЕТОД Serial.print
    Serial.println(epoch);            // МЕТОД Serial.println
    Serial.print("GMT+3 time = ");    // МЕТОД Serial.print
    Serial.println(gmt3);             // МЕТОД Serial.println

    /////////////////////////////////////////////////////////////////////////////// TS15
    // ----------------------------------------------------------------------------
    //                                                                       ЗАДАЧА
    // расчёт числа часов, минут, секунд времени GMT+3.
    // применяется формат HH:MM:SS
    // ----------------------------------------------------------------------------
    ///////////////////////////////////////////////////////////////////////////////

    thrs = int((gmt3 % secsDay) / 3600);
    tmin = int((gmt3 % 3600) / 60);
    tsec = int(gmt3 % 60);

    /////////////////////////////////////////////////////////////////////////////// TS16
    // ----------------------------------------------------------------------------
    //                                                                       ЗАДАЧА
    // печать в UART информации о количестве часов для времени GMT+3.
    // ЕСЛИ число часов < 10: ТО сначала необходимо напечатать '0'
    // ----------------------------------------------------------------------------
    ///////////////////////////////////////////////////////////////////////////////

    Serial.print("Moscow time is "); // МЕТОД Serial.print

    if (thrs < 10)

      Serial.print('0'); // МЕТОД Serial.print

    Serial.print(thrs); // МЕТОД Serial.print
    Serial.print(':');  // МЕТОД Serial.print

    /////////////////////////////////////////////////////////////////////////////// TS17
    // ----------------------------------------------------------------------------
    //                                                                       ЗАДАЧА
    // печать в UART информации о количестве минут для времени GMT+3.
    // ЕСЛИ число минут < 10: ТО сначала необходимо напечатать '0'
    // ----------------------------------------------------------------------------
    ///////////////////////////////////////////////////////////////////////////////

    if (tmin < 10)

      Serial.print('0'); // МЕТОД Serial.print

