dastin-alex/esp8266_test/src/main.cpp
    Serial.print(tmin); // МЕТОД Serial.print
    Serial.print(':');  // МЕТОД Serial.print

    /////////////////////////////////////////////////////////////////////////////// TS18
    // ----------------------------------------------------------------------------
    //                                                                       ЗАДАЧА
    // печать в UART информации о количестве секунд для времени GMT+3.
    // ЕСЛИ число секунд < 10: ТО сначала необходимо напечатать '0'
    // ----------------------------------------------------------------------------
    ///////////////////////////////////////////////////////////////////////////////

    if (tsec < 10)

      Serial.print('0'); // МЕТОД Serial.print

    Serial.println(tsec); // МЕТОД Serial.println
    Serial.println();     // МЕТОД Serial.println
  }

  /////////////////////////////////////////////////////////////////////////////// TS19
  // ---------------------------------------------------------------------- delay 3000
  //                                                                       ЗАДАЧА
  // пауза ожидания 3 сек перед новым запросом времени
  // ----------------------------------------------------------------------------
  ///////////////////////////////////////////////////////////////////////////////

  delay(3000);

  ///////////////////////////////////////////////////////////////////////////////////////
  // ------------------------------------------------------------------------------------
  //                                                        РЕГУЛЯРНО ИСПОЛНЯЕМЫЙ ПРОЦЕСС
  // непрерывная световая сигнализация                                              blink
  // управление встроенным светодиодом LED_BUILTIN
  // ------------------------------------------------------------------------------------
  ///////////////////////////////////////////////////////////////////////////////////////
  // ------------------------------------------------------------------------------------

  /////////////////////////////////////////////////////////////////////////////// BL01
  // ---------------------------------------------------------------------- delay 200
  // свечение LED_BUILTIN в режиме HIGH
  // пауза ожидания 20 мсек
  // ----------------------------------------------------------------------------
  ///////////////////////////////////////////////////////////////////////////////

  digitalWrite(LED_BUILTIN, HIGH);
  delay(20);

  /////////////////////////////////////////////////////////////////////////////// BL02
  // ---------------------------------------------------------------------- delay 3000
  // свечение LED_BUILTIN в режиме LOW
  // пауза ожидания 3000 мсек
  // ----------------------------------------------------------------------------
  ///////////////////////////////////////////////////////////////////////////////

  digitalWrite(LED_BUILTIN, LOW);
  delay(300);

  /////////////////////////////////////////////////////////////////////////////// BL03
  // ---------------------------------------------------------------------- delay 200
  // свечение LED_BUILTIN в режиме HIGH
  // пауза ожидания 20 мсек
  // ----------------------------------------------------------------------------
  ///////////////////////////////////////////////////////////////////////////////

  digitalWrite(LED_BUILTIN, HIGH);
  delay(20);

  /////////////////////////////////////////////////////////////////////////////// BL04
  // ---------------------------------------------------------------------- delay 3000
  // свечение LED_BUILTIN в режиме LOW
  // пауза ожидания 3000 мсек
  // ----------------------------------------------------------------------------
  ///////////////////////////////////////////////////////////////////////////////

  digitalWrite(LED_BUILTIN, LOW);
  delay(300);

  /////////////////////////////////////////////////////////////////////////////// BL05
  // ---------------------------------------------------------------------- delay 5000
  // свечение LED_BUILTIN в режиме HIGH
  // пауза ожидания 500 мсек
  // ----------------------------------------------------------------------------
  ///////////////////////////////////////////////////////////////////////////////

  digitalWrite(LED_BUILTIN, HIGH);
  delay(5000);

  /////////////////////////////////////////////////////////////////////////////// BL06
  // ---------------------------------------------------------------------- delay 5000
  // свечение LED_BUILTIN в режиме LOW
  // пауза ожидания 500 мсек
  // ----------------------------------------------------------------------------
  ///////////////////////////////////////////////////////////////////////////////

  digitalWrite(LED_BUILTIN, LOW);
  delay(5000);

  /////////////////////////////////////////////////////////////////////////////// BL07
  // ---------------------------------------------------------------------- delay 5000
  // свечение LED_BUILTIN в режиме HIGH
  // пауза ожидания 500 мсек
  // ----------------------------------------------------------------------------
  ///////////////////////////////////////////////////////////////////////////////

  digitalWrite(LED_BUILTIN, HIGH);
  delay(5000);

  /////////////////////////////////////////////////////////////////////////////// BL08
  // ---------------------------------------------------------------------- delay 5000
  // свечение LED_BUILTIN в режиме LOW
  // пауза ожидания 500 мсек
  // ----------------------------------------------------------------------------
  ///////////////////////////////////////////////////////////////////////////////

  digitalWrite(LED_BUILTIN, LOW);
  delay(5000);

  ///////////////////////////////////////////////////////////////////////////////////////
  // ------------------------------------------------------------------------------------
  //                                                        РЕГУЛЯРНО ИСПОЛНЯЕМЫЙ ПРОЦЕСС
  // контроль нажатия встроенной кнопки                                          keypress
  // опрос, обработка состояния встроенной кнопки FLASH (IO0, GPIO0, SPICS2) - 15
  // ------------------------------------------------------------------------------------
  ///////////////////////////////////////////////////////////////////////////////////////
  // ------------------------------------------------------------------------------------
  //
  // (KP00) -> KP01, KP02, KP03, KP04, KP05, KP06, KP07, KP08
  //            |                                         |
  //            |-----------------------------------------|
  //
  // ------------------------------------------------------------------------------------
  ///////////////////////////////////////////////////////////////////////////////////////

  /////////////////////////////////////////////////////////////////////////////// KP01
  // ----------------------------------------------------------------------------
  // начальная настройка
  // контакт встроенной кнопки FLASH (IO0, GPIO0, SPICS2) - 15
  // ----------------------------------------------------------------------------
  ///////////////////////////////////////////////////////////////////////////////

  keypress();
}
